================================================================================
Simple constant variable
================================================================================

std test(): void { c x = 42 }

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (function_color)
    name: (identifier)
    (parameter_list)
    return_type: (primitive_type)
    (block
      (variable_declaration
        (variable_modifier)
        name: (identifier)
        (integer_literal)))))

================================================================================
Mutable variable
================================================================================

std test(): void { m counter = 0 }

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (function_color)
    name: (identifier)
    (parameter_list)
    return_type: (primitive_type)
    (block
      (variable_declaration
        (variable_modifier)
        name: (identifier)
        (integer_literal)))))

================================================================================
Heap allocated variable
================================================================================

std test(): void { h data = [1, 2, 3] }

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (function_color)
    name: (identifier)
    (parameter_list)
    return_type: (primitive_type)
    (block
      (variable_declaration
        (variable_modifier)
        name: (identifier)
        (array_expression
          (integer_literal)
          (integer_literal)
          (integer_literal))))))

================================================================================
Combined modifiers (mutable heap)
================================================================================

std test(): void { mh buffer = [0] }

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (function_color)
    name: (identifier)
    (parameter_list)
    return_type: (primitive_type)
    (block
      (variable_declaration
        (variable_modifier)
        name: (identifier)
        (array_expression
          (integer_literal))))))

================================================================================
Variable with type annotation
================================================================================

std test(): void { c count: i64 = 100 }

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (function_color)
    name: (identifier)
    (parameter_list)
    return_type: (primitive_type)
    (block
      (variable_declaration
        (variable_modifier)
        name: (identifier)
        (primitive_type)
        (integer_literal)))))

================================================================================
Global variable
================================================================================

std test(): void { g config = "default" }

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (function_color)
    name: (identifier)
    (parameter_list)
    return_type: (primitive_type)
    (block
      (variable_declaration
        (variable_modifier)
        name: (identifier)
        (string_literal)))))

================================================================================
Undetermined type variable
================================================================================

std test(): void { u value = 3.14 }

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (function_color)
    name: (identifier)
    (parameter_list)
    return_type: (primitive_type)
    (block
      (variable_declaration
        (variable_modifier)
        name: (identifier)
        (float_literal)))))

================================================================================
Locked variable
================================================================================

std test(): void { l shared = 0 }

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (function_color)
    name: (identifier)
    (parameter_list)
    return_type: (primitive_type)
    (block
      (variable_declaration
        (variable_modifier)
        name: (identifier)
        (integer_literal)))))

================================================================================
Boolean variable
================================================================================

std test(): void { c flag = true }

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (function_color)
    name: (identifier)
    (parameter_list)
    return_type: (primitive_type)
    (block
      (variable_declaration
        (variable_modifier)
        name: (identifier)
        (boolean_literal)))))

================================================================================
String variable
================================================================================

std test(): void { c message = "Hello, World!" }

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (function_color)
    name: (identifier)
    (parameter_list)
    return_type: (primitive_type)
    (block
      (variable_declaration
        (variable_modifier)
        name: (identifier)
        (string_literal)))))
